# Pandas Week 2 - Joshua Lewi

In [4]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

### 5. Membalik Urutan Baris dan Kolom pada Data Frame

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  3  4  5  6
1  2  7  8  8  8
2  3  7  8  2  1
3  4  6  6  2  2
4  4  7  8  5  6

In [6]:
#1 Membalik urutan Kolom.
df.loc[:, ::-1] #pertama mengatur baris, kedua mengatur kolom. -1 = reversing.

   E  D  C  B  A
0  6  5  4  3  4
1  8  8  8  7  2
2  1  2  8  7  3
3  2  2  6  6  4
4  6  5  8  7  4

In [10]:
#2 Membalik urutan Baris.
df.loc[::-1] #pertama mengatur baris, kedua mengatur kolom. -1 = reversing.

   A  B  C  D  E
4  4  7  8  5  6
3  4  6  6  2  2
2  3  7  8  2  1
1  2  7  8  8  8
0  4  3  4  5  6

In [11]:
# Membalik urutan baris dan melakukan penyesuaian ulang index (reindexing)
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  7  8  5  6
1  4  6  6  2  2
2  3  7  8  2  1
3  2  7  8  8  8
4  4  3  4  5  6

### 6. Mengganti nama kolom pada Data Frame

In [13]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  9  7  6  6  9
1  3  9  5  6  8
2  1  9  4  1  8
3  3  5  7  8  9
4  4  2  6  5  5

In [14]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  9  7     6  6  9
1  3  9     5  6  8
2  1  9     4  1  8
3  3  5     7  8  9
4  4  2     6  5  5

In [16]:
#Mengganti nama (label) untuk banyak kolom pada DataFrame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     9       7  6     6  9
1     3       9  5     6  8
2     1       9  4     1  8
3     3       5  7     8  9
4     4       2  6     5  5

### 7. Menghapus missing values pada DataFrame

In [21]:
import pandas as pd
import numpy as np  
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [26]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, np.nan, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}).reset_index()

df.head()

   index    A    B    C  D
0      0  1.0  NaN  1.0  1
1      1  2.0  2.0  NaN  2
2      2  NaN  3.0  3.0  3
3      3  4.0  4.0  NaN  4
4      4  5.0  5.0  5.0  5

In [27]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z    A    B    C  D
0  0  1.0  NaN  1.0  1
1  1  2.0  2.0  NaN  2
2  2  NaN  3.0  3.0  3
3  3  4.0  4.0  NaN  4
4  4  5.0  5.0  5.0  5

In [28]:
df_backup = df.copy(deep=True)  # Membuat salinan cadangan DataFrame

In [ ]:
#menghapus kolom missing values pada DataFrame
df = df.dropna(axis='columns')  # Menghapus kolom dengan missing values
df.head()

   Z  D
0  0  1
1  1  2
2  2  3
3  3  4
4  4  5

In [31]:
#Menghapus setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)  # Mengembalikan DataFrame dari cadangan
df = df.dropna(axis='rows')
df.head()

   Z    A    B    C  D
4  4  5.0  5.0  5.0  5

In [ ]:
#Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.0
A    0.2
B    0.2
C    0.4
D    0.0
dtype: float64

In [33]:
#menghapus setiap kolom yang memiliki missing values berdasarkan threshold
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z  D
0  0  1
1  1  2
2  2  3
3  3  4
4  4  5

### 8. Memeriksa kesamaan antar kolom/series pada Data Frame

In [34]:
data = {'A': [15, 15, 18, np.nan, 12],
        'B': [15, 15, 18, np.nan, 12],}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [37]:
#Mengenal pandas series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [36]:
type(df['A'])

pandas.core.series.Series

In [38]:
type(df)

pandas.core.frame.DataFrame

In [40]:
#Memeriksa kesamaan dengan operator ==
df['A'] == df['B'] #value "nan" tidak bisa membandingkan dengan baik

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [41]:
#Alternatif: .equals(), membandingkan dua buah kolom lebih baik menggunakan ini.
df['A'].equals(df['B'])

True

In [44]:
#.equals() atau == bisa digunakan antar dua DataFrame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [43]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True